app/controllers/tests_controller.rb

SELECT `tests`.* FROM `tests`
---
  def index
    @tests = Test.all

INSERT INTO `tests` (`description`, `question`, `alternative1`, `alternative2`, `alternative3`, `alternative4`, `answer`, `created_at`, `updated_at`) VALUES ('1', '1', '1', '1', '1', '1', '1', '2016-05-21 21:19:24', '2016-05-21 21:19:24')
---
  def create
    @test = Test.new(test_params)

    respond_to do |format|
      if @test.save

UPDATE `tests` SET `description` = '2', `question` = '2', `alternative1` = '2', `alternative2` = '2', `alternative3` = '2', `alternative4` = '2', `answer` = '2', `updated_at` = '2016-05-21 21:19:43' WHERE `tests`.`id` = 2
---
  def update
    respond_to do |format|
      if @test.update(test_params)

SELECT  `tests`.* FROM `tests` WHERE `tests`.`id` = 3 LIMIT 1
---
    def set_test
      @test = Test.find(params[:id])