app/controllers/videos_controller.rb

  def index
    @videos = Video.all
---
SELECT `videos`.* FROM `videos`

  def example
    @a = params
    @video = Video.find(params[:description])
---
SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 0 LIMIT 1

  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save
---
INSERT INTO `videos` (`description`, `created_at`, `updated_at`) VALUES ('1', '2016-05-21 21:20:00', '2016-05-21 21:20:00')

  def update
    respond_to do |format|
      if @video.update(video_params)
---
UPDATE `videos` SET `description` = '2', `updated_at` = '2016-05-21 21:20:06' WHERE `videos`.`id` = 1

    def set_video
      @video = Video.find(params[:id])
---
SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 2 LIMIT 1